---
kind: method
id: M:Autodesk.Revit.UI.Events.CanExecuteEventArgs.GetSelectedCategoryIds
source: html/c29679c2-ed20-1f21-47fe-dbee07c91d93.htm
---
# Autodesk.Revit.UI.Events.CanExecuteEventArgs.GetSelectedCategoryIds Method

Gets the category ids of selected elements.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetSelectedCategoryIds()
```